DeviceLogonEvents
| where UserName == "NightPrincess"
| where LogonTime between (datetime(2023-01-01 12:00:00) .. datetime(2023-01-01 13:00:00))
| project DeviceName, LogonType, LogonTime
| order by LogonTime asc
| take 10 
